//========================================================================
//        author   : masw
//        email    : masw@masw.tech     
//        creattime: 2023年08月20日 日曜日 23時22分01秒
//========================================================================


#include "alex_iic.h"




/*
 
I2C

読み出し
    __    ___ ___ ___ ___ ___ ___ ___         ___ ___ ___ ___ ___ ___ ___ ___     ___ ___ ___ ___ ___ ___ ___ ___        __
sda   \__/_6_X_5_X_4_X_3_X_2_X_1_X_0_\_R___A_/_7_X_6_X_5_X_4_X_3_X_2_X_1_X_0_\_A_/_7_X_6_X_5_X_4_X_3_X_2_X_1_X_0_\_A____/
    ____   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   ____
scl  ST \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ SP

書き込み
    __    ___ ___ ___ ___ ___ ___ ___ ___     ___ ___ ___ ___ ___ ___ ___ ___     ___ ___ ___ ___ ___ ___ ___ ___ ___    __
sda   \__/_6_X_5_X_4_X_3_X_2_X_1_X_0_/ W \_A_/_7_X_6_X_5_X_4_X_3_X_2_X_1_X_0_\_A_/_7_X_6_X_5_X_4_X_3_X_2_X_1_X_0_/ N \__/
    ____   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   _   ____
scl  ST \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ \_/ SP

レジスタ：

| 番地   | 名称           |
|--------|----------------|
| 0x00   | 状態           |
| 0x04   | 命令           |
| 0x08   | データ         |
| 0x0C   | 分周比          |

ステータスレジスタ：

| 番地   | 名称           |   bit31   |   bit30   |   bit29   |   bit28   |   bit27   |   bit26   |   bit25   |   bit24   |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x00   | データ         |     -     |     -     |     -     |     -     |     -     |     -     |     -     |     -     |

| 番地   | 名称           |   bit23   |   bit22   |   bit21   |   bit20   |   bit19   |   bit18   |   bit17   |   bit16   |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x00   | データ         |     -     |     -     |     -     |     -     |     -     |     -     |     -     |     -     |

| 番地   | 名称           |   bit15   |   bit14   |   bit13   |   bit12   |   bit11   |   bit10   |   bit9    |   bit8    |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x00   | 状態           |  rd_full  | rd_empty  |  wr_ovf   |  wr_full  | wr_empty  |  cmd_ovf  | cmd_full  | cmd_empty |

| 番地   | 名称           |   bit7    |   bit6    |   bit5    |   bit4    |   bit3    |   bit2    |   bit1    |   bit0    |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x00   | 状態           |     -     |     -     |     -     |     -     | miss_ack  |  bus_act  | bus_cont  |   busy    |

busy：モジュールが I2C 操作を実行中のとき High
bus_cont：モジュールがアクティブなバスを制御しているとき High
bus_act：バスがアクティブなとき High
miss_ack：スレーブからの ACK パルスが検出されなかったとき High にセット；1 を書き込むとクリア
cmd_empty：コマンド FIFO が空
cmd_full：コマンド FIFO が満杯
cmd_ovf：コマンド FIFO オーバーフロー；1 を書き込むとクリア
wr_empty：書き込みデータ FIFO が空
wr_full：書き込みデータ FIFO が満杯
wr_ovf：書き込みデータ FIFO オーバーフロー；1 を書き込むとクリア
rd_empty：読み出しデータ FIFO が空
rd_full：読み出しデータ FIFO が満杯

コマンドレジスタ：

| 番地   | 名称           |   bit31   |   bit30   |   bit29   |   bit28   |   bit27   |   bit26   |   bit25   |   bit24   |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x04   | データ         |     -     |     -     |     -     |     -     |     -     |     -     |     -     |     -     |

| 番地   | 名称           |   bit23   |   bit22   |   bit21   |   bit20   |   bit19   |   bit18   |   bit17   |   bit16   |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x04   | データ         |     -     |     -     |     -     |     -     |     -     |     -     |     -     |


| 番地   | 名称           |   bit15   |   bit14   |   bit13   |   bit12   |   bit11   |   bit10   |   bit9    |   bit8    |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x04   | 命令           |     -     |     -     |     -     | cmd_stop  | cmd_wr_m  | cmd_write | cmd_read  | cmd_start |

| 番地   | 名称           |   bit7    |   bit6    |   bit5    |   bit4    |   bit3    |   bit2    |   bit1    |   bit0    |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x04   | 命令           |     -     |                               cmd_address[6:0]                                    |

cmd_address：コマンドの I2C アドレス
cmd_start：High にすると I2C スタートを発行。書き込むとコマンド FIFO に投入される
cmd_read：High にすると読み出しを開始。書き込むとコマンド FIFO に投入される
cmd_write：High にすると書き込みを開始。書き込むとコマンド FIFO に投入される
cmd_write_multiple：High にするとブロック書き込みを開始。書き込むとコマンド FIFO に投入される
cmd_stop：High にすると I2C ストップを発行。書き込むとコマンド FIFO に投入される

複数のコマンドビットを同時にセットできる。まずスタートまたはリピートスタートが発行され、次に読み出しまたは書き込み、最後にストップが発行される。読み出しと書き込みを同時にセットすることは許可されておらず、その場合コマンドは無視されるので注意。

データレジスタ：

| 番地   | 名称           |   bit31   |   bit30   |   bit29   |   bit28   |   bit27   |   bit26   |   bit25   |   bit24   |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x08   | データ         |     -     |     -     |     -     |     -     |     -     |     -     |     -     |     -     |

| 番地   | 名称           |   bit23   |   bit22   |   bit21   |   bit20   |   bit19   |   bit18   |   bit17   |   bit16   |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x08   | データ         |     -     |     -     |     -     |     -     |     -     |     -     |     -     |     -     |

| 番地   | 名称           |   bit15   |   bit14   |   bit13   |   bit12   |   bit11   |   bit10   |   bit9    |   bit8    |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x08   | データ         |     -     |     -     |     -     |     -     |     -     |     -     | data_last | data_valid |

| 番地   | 名称           |   bit7    |   bit6    |   bit5    |   bit4    |   bit3    |   bit2    |   bit1    |   bit0    |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x08   | データ         |                                           data[7:0]                                           |

data：I2C データ。書き込むと書き込みデータ FIFO に投入され、読み出すと読み出しデータ FIFO から取り出される
data_valid：有効な読み出しデータであることを示す。16 ビットのアトミックな読み書きアクセスを使う必要がある
data_last：ブロック書き込み（write_multiple）の最終バイトを示す。16 ビットのアトミックな読み書きアクセスを使う必要がある

分周比（プリスケール）レジスタ：

| 番地   | 名称           |   bit31   |   bit30   |   bit29   |   bit28   |   bit27   |   bit26   |   bit25   |   bit24   |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x0C   | データ         |     -     |     -     |     -     |     -     |     -     |     -     |     -     |     -     |

| 番地   | 名称           |   bit23   |   bit22   |   bit21   |   bit20   |   bit19   |   bit18   |   bit17   |   bit16   |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x0C   | データ         |     -     |     -     |     -     |     -     |     -     |     -     |     -     |     -     |

| 番地   | 名称           |   bit15   |   bit14   |   bit13   |   bit12   |   bit11   |   bit10   |   bit9    |   bit8    |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x0C   | 分周比          |                                         prescale[15:8]                                        |

| 番地   | 名称           |   bit7    |   bit6    |   bit5    |   bit4    |   bit3    |   bit2    |   bit1    |   bit0    |
|--------|----------------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|-----------|
| 0x0C   | 分周比          |                                         prescale[7:0]                                         |

prescale：分周比（プリスケール値）を設定

分周比を I2C クロック周期の 1/4 に相当する値に設定する。単位は入力クロック周期

prescale = Fclk / (FI2Cclk * 4)

コマンド：

読み出し
    データバイトを読み出す
    start をセットするとスタートコンディションを強制的に生成する
    バスが非アクティブ、読み出し以外でアクティブ、またはアドレスが異なる場合は、スタートコンディションが暗黙的に生成される
    stop をセットすると、現在のバイトを読み出した後にストップコンディションを発行する
    読み出しコマンドで stop をセットすると、data_out_last がセットされる

書き込み
    データバイトを書き込む
    start をセットするとスタートコンディションを強制的に生成する
    バスが非アクティブ、書き込み以外でアクティブ、またはアドレスが異なる場合は、スタートコンディションが暗黙的に生成される
    stop をセットすると、現在のバイトを書き込んだ後にストップコンディションを発行する

複数バイト書き込み
    複数のデータバイトを書き込む（data_in_last まで）
    start をセットするとスタートコンディションを強制的に生成する
    バスが非アクティブ、読み出し以外でアクティブ、またはアドレスが異なる場合は、スタートコンディションが暗黙的に生成される
    stop をセットすると、ブロックを書き込んだ後にストップコンディションを発行する

ストップ
    バスがアクティブならストップコンディションを発行する

ステータス：

busy
    モジュールがバス経由で通信中

bus_control
    モジュールがアクティブな状態でバスを制御している

bus_active
    バスがアクティブ（このモジュールが制御しているとは限らない）

missed_ack
    スレーブからの ACK が検出されなかったときに strobe される

パラメータ：

prescale
    分周比を I2C クロック周期の 1/4 に相当する値に設定する（prescale = Fclk / (FI2Cclk * 4)）

stop_on_idle
    コマンド入力が無効になったとき自動的にストップコンディションを発行する

*/




u32 alex_get_status(uintptr_t baseaddr)
{
//#define ALEX_MASK_BUSY      0x00000001//モジュールが I2C 操作を実行中のとき High
//#define ALEX_MASK_BUS_CONT  0x00000002//モジュールがアクティブなバスを制御しているとき High
//#define ALEX_MASK_BUS_ACT   0x00000004//バスがアクティブなとき High
//#define ALEX_MASK_MISS_ACK  0x00000008//スレーブからの ACK パルスが検出されなかったとき High にセット；1 を書き込むとクリア
//#define ALEX_MASK_CMD_EMPTY 0x00000100//コマンド FIFO が空
//#define ALEX_MASK_CMD_FULL  0x00000200//コマンド FIFO が満杯
//#define ALEX_MASK_CMD_OVF   0x00000400//コマンド FIFO オーバーフロー；1 を書き込むとクリア
//#define ALEX_MASK_WR_EMPTY  0x00000800//書き込みデータ FIFO が空
//#define ALEX_MASK_WR_FULL   0x00001000//書き込みデータ FIFO が満杯
//#define ALEX_MASK_WR_OVF    0x00002000//書き込みデータ FIFO オーバーフロー；1 を書き込むとクリア
//#define ALEX_MASK_RD_EMPTY  0x00004000//読み出しデータ FIFO が空
//#define ALEX_MASK_RD_FULL   0x00008000//読み出しデータ FIFO が満杯
	return *(volatile u32 *) baseaddr;
}

u32 alex_get_command(uintptr_t baseaddr)
{
	return *(volatile u32 *) (baseaddr+0x4);
}

u32 alex_set_command(uintptr_t baseaddr, u32 cmd)
{
    volatile u32 *LocalAddr = (volatile u32 *)(baseaddr + 0x4);
    *LocalAddr = cmd;
	return 0;
}


u32 alex_get_fifo(uintptr_t baseaddr)
{
	return *(volatile u32 *) (baseaddr+0x8);
}

u32 alex_put_fifo(uintptr_t baseaddr, u32 data)
{
    volatile u32 *LocalAddr = (volatile u32 *)(baseaddr + 0x8);
    *LocalAddr = data;
	return 0;
}

//=====================================================================================================
//=====================================================================================================
//=====================================================================================================

int alex_iic_wb_read (uintptr_t baseaddr, u8 iicaddr, u8 regaddr, u16 *readback)
{
//読み出し
//    データバイトを読み出す
//    start をセットするとスタートコンディションを強制的に生成する
//    バスが非アクティブ、読み出し以外でアクティブ、またはアドレスが異なる場合は、スタートコンディションが暗黙的に生成される
//    stop をセットすると、現在のバイトを読み出した後にストップコンディションを発行する
//    読み出しコマンドで stop をセットすると、data_out_last がセットされる
//
//1. 書き込み
//    データバイトを書き込む
//    start をセットするとスタートコンディションを強制的に生成する
//    バスが非アクティブ、書き込み以外でアクティブ、またはアドレスが異なる場合は、スタートコンディションが暗黙的に生成される
//    stop をセットすると、現在のバイトを書き込んだ後にストップコンディションを発行する

//cmd_address：コマンドの I2C アドレス
//cmd_start：High にすると I2C スタートを発行。書き込むとコマンド FIFO に投入される
//cmd_read：High にすると読み出しを開始。書き込むとコマンド FIFO に投入される
//cmd_write：High にすると書き込みを開始。書き込むとコマンド FIFO に投入される
//cmd_write_multiple：High にするとブロック書き込みを開始。書き込むとコマンド FIFO に投入される
//cmd_stop：High にすると I2C ストップを発行。書き込むとコマンド FIFO に投入される
	//1. データバイトを書き込む
	alex_put_fifo   (baseaddr, ALEX_DATA_LAST | regaddr );
	//2. スレーブアドレスを書き込む
	alex_set_command(baseaddr, ALEX_CMD_START | iicaddr );
	alex_set_command(baseaddr, ALEX_CMD_WRITE           );
	alex_set_command(baseaddr, ALEX_CMD_START | iicaddr );
	alex_set_command(baseaddr, ALEX_CMD_READ            );
	alex_set_command(baseaddr, ALEX_CMD_READ            );
	alex_set_command(baseaddr, ALEX_CMD_STOP            );

	while(alex_get_status(baseaddr) & ALEX_MASK_BUSY) {};

	u32 lsb = alex_get_fifo   (baseaddr);
	u32 msb = alex_get_fifo   (baseaddr);

	*readback = (msb & 0xff) << 8 | (lsb & 0xff);

	return 0;
}



int alex_iic_wb_write(uintptr_t baseaddr, u8 iicaddr, u8 regaddr, u16 *readback)
{
	
	return 0;
}
